---

C#Visual BasicVisual C++

Revit 2024 API
---
PhaseArray..::..Insert Method
PhaseArray Class See Also Send Feedback
---

Insert the specified phase into the array.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual void Insert(
    	Phase item,
    	int index
    )

Visual Basic
---

    Public Overridable Sub Insert ( _
    	item As Phase, _
    	index As Integer _
    )

Visual C++
---

    public:
    virtual void Insert(
    	Phase^ item,
    	int index
    )

#### Parameters

item
    Type: Autodesk.Revit.DB..::..PhaseThe phase to be inserted into the array.

index
    Type: System..::..Int32The phase will be inserted before this index.

#### Return Value

Returns whether the phase was inserted into the array.

# See Also

PhaseArray Class

Autodesk.Revit.DB Namespace